# DATAFRAMES
### They are the main tools for using pandas

In [337]:
import numpy as np
import pandas as pd

In [338]:
from numpy.random import randn
from numpy.random import randint

In [339]:
np.random.seed(101) # For getting same random numbers

## Using randint in the Dataframe

In [340]:
randint(0,20,20).reshape(5,4)

array([[11, 17,  6, 11],
       [15,  9, 13,  8],
       [ 4,  8,  0, 14],
       [ 5, 12,  8, 17],
       [19, 15,  8, 19]])

### A nice DataFrame for the above array with 'randint'
A,B,C,D,E are for the rows and W,X,Y,Z for the columns

In [341]:
pd.DataFrame(randint(0,20,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

    W   X   Y   Z
A  19   2  12   8
B  19  10  12  11
C   0   9   9  15
D   8   4  19   3
E   7  10   7   6

## Using randn in the Dataframe

In [310]:
randn(5,4)

array([[-0.39746171,  1.26168798,  0.43333132, -0.1366137 ],
       [ 0.88213984, -0.37781124,  0.1466388 ,  1.26912178],
       [ 0.30788108, -0.60680554,  0.91931842, -1.1961184 ],
       [ 0.50894522, -0.84843996,  2.01079346, -0.1376097 ],
       [-0.59826923,  0.02823374,  0.39274608, -1.44169525]])

### A nice DataFrame for the above array with 'randn'

A,B,C,D,E are for the rows and W,X,Y,Z for the columns

In [311]:
FRAME = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
FRAME

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822
E  1.652070  0.196925  0.103214 -0.147370

## GRABBING COLUMNS FROM THE DATAFRAMES

In [312]:
print(f"{FRAME['W']}\n") # for getting the row from "W" row
print(f"{FRAME['X']}\n") # for getting the row from "X" row
print(f"{FRAME['Y']}\n") # for getting the row from "Y" row
print(f"{FRAME['Z']}\n") # for getting the row from "Z" row

A    0.000323
B   -2.711192
C    1.131029
D    1.852155
E    1.652070
Name: W, dtype: float64

A   -1.049912
B   -1.522410
C    0.498600
D   -0.892172
E    0.196925
Name: X, dtype: float64

A   -0.229937
B   -1.416207
C    1.179022
D    0.616861
E    0.103214
Name: Y, dtype: float64

A   -1.283599
B    1.108544
C    1.322684
D   -1.121822
E   -0.147370
Name: Z, dtype: float64

In [313]:
FRAME[['W','Y']] # Grabbing multiple rows

          W         Y
A  0.000323 -0.229937
B -2.711192 -1.416207
C  1.131029  1.179022
D  1.852155  0.616861
E  1.652070  0.103214

MEATHOD 1 OF GRABBING THE DATA 
recommanded meathod

In [314]:
print(f"{FRAME.W}\n") # for getting the row from "W" row
print(f"{FRAME.X}\n") # for getting the row from "X" row
print(f"{FRAME.Y}\n") # for getting the row from "Y" row
print(f"{FRAME.Z}\n") # for getting the row from "Z" row

A    0.000323
B   -2.711192
C    1.131029
D    1.852155
E    1.652070
Name: W, dtype: float64

A   -1.049912
B   -1.522410
C    0.498600
D   -0.892172
E    0.196925
Name: X, dtype: float64

A   -0.229937
B   -1.416207
C    1.179022
D    0.616861
E    0.103214
Name: Y, dtype: float64

A   -1.283599
B    1.108544
C    1.322684
D   -1.121822
E   -0.147370
Name: Z, dtype: float64

MEATHOD 2 OF GRABBING THE DATA

### NEW COLUMN making

In [315]:
# Making of a new column in "FRAME" as 'new'
FRAME['new'] = FRAME['W'] + FRAME['X'] 
FRAME

          W         X         Y         Z       new
A  0.000323 -1.049912 -0.229937 -1.283599 -1.049589
B -2.711192 -1.522410 -1.416207  1.108544 -4.233602
C  1.131029  0.498600  1.179022  1.322684  1.629629
D  1.852155 -0.892172  0.616861 -1.121822  0.959983
E  1.652070  0.196925  0.103214 -0.147370  1.848996

In [316]:
df = pd.DataFrame(randint(0,20,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df # for further use

    W   X   Y   Z
A  17  11   4   7
B  11   5  17  18
C  13   6   3  14
D  17  13  15  17
E   0  15  18  11

In [317]:
#Adding new column as "addition" of all the rows
df['addition'] = df['W'] + df['X'] + df['Y'] + df['Z']
df

    W   X   Y   Z  addition
A  17  11   4   7        39
B  11   5  17  18        51
C  13   6   3  14        36
D  17  13  15  17        62
E   0  15  18  11        44

## Dropping a Column

In [318]:
FRAME

          W         X         Y         Z       new
A  0.000323 -1.049912 -0.229937 -1.283599 -1.049589
B -2.711192 -1.522410 -1.416207  1.108544 -4.233602
C  1.131029  0.498600  1.179022  1.322684  1.629629
D  1.852155 -0.892172  0.616861 -1.121822  0.959983
E  1.652070  0.196925  0.103214 -0.147370  1.848996

In [319]:
df

    W   X   Y   Z  addition
A  17  11   4   7        39
B  11   5  17  18        51
C  13   6   3  14        36
D  17  13  15  17        62
E   0  15  18  11        44

In [320]:
FRAME.drop('new', axis=1, inplace=False) # droppin that 'new' in FRAME
# Note that this dosn't do anything with original FRAME
# Here inplace is said to false as default

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822
E  1.652070  0.196925  0.103214 -0.147370

In [321]:
FRAME # doesnt changed anything in this

          W         X         Y         Z       new
A  0.000323 -1.049912 -0.229937 -1.283599 -1.049589
B -2.711192 -1.522410 -1.416207  1.108544 -4.233602
C  1.131029  0.498600  1.179022  1.322684  1.629629
D  1.852155 -0.892172  0.616861 -1.121822  0.959983
E  1.652070  0.196925  0.103214 -0.147370  1.848996

In [322]:
# Here inplace is set to true and done in the main 'FRAME' too
FRAME.drop('new', axis=1, inplace=True) # dropping column

In [323]:
FRAME

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822
E  1.652070  0.196925  0.103214 -0.147370

## Dropping a Row

In [324]:
# axis=0 is a row but it is default if 'E' is a row
FRAME.drop('E', axis=0)

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822

In [325]:
FRAME # not changed in the main FRAME

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822
E  1.652070  0.196925  0.103214 -0.147370

In [326]:
# Dropping a row in the main FRAME too
FRAME.drop('E', axis=0, inplace=True)

In [327]:
FRAME

          W         X         Y         Z
A  0.000323 -1.049912 -0.229937 -1.283599
B -2.711192 -1.522410 -1.416207  1.108544
C  1.131029  0.498600  1.179022  1.322684
D  1.852155 -0.892172  0.616861 -1.121822

In [328]:
# Note that rows represent at axis=0, columns at axis=1
FRAME.shape

(4, 4)

This will tell the shape of a dataframe

## GRABBING ROWS FROM THE DATAFRAMES

In [329]:
df

    W   X   Y   Z  addition
A  17  11   4   7        39
B  11   5  17  18        51
C  13   6   3  14        36
D  17  13  15  17        62
E   0  15  18  11        44

#### MEATHOD 1

In [330]:
ROW_A = df.loc['A'] # row "A"
ROW_B = df.loc['B'] # row "B"
ROW_C = df.loc['C'] # row "C"
ROW_D = df.loc['D'] # row "D"
ROW_E = df.loc['E'] # row "E"

In [331]:
print(f'\n Row A: \n\n {ROW_A}')
print(f'\n Row B: \n\n {ROW_B}')
print(f'\n Row C: \n\n {ROW_C}')
print(f'\n Row D: \n\n {ROW_D}')
print(f'\n Row E: \n\n {ROW_E}')

 Row A:

 W           17
X           11
Y            4
Z            7
addition    39
Name: A, dtype: int32

 Row B:

 W           11
X            5
Y           17
Z           18
addition    51
Name: B, dtype: int32

 Row C:

 W           13
X            6
Y            3
Z           14
addition    36
Name: C, dtype: int32

 Row D:

 W           17
X           13
Y           15
Z           17
addition    62
Name: D, dtype: int32

 Row E:

 W            0
X           15
Y           18
Z           11
addition    44
Name: E, dtype: int32

#### MEATHOD 2
BY PASSING THE INDEX OF THAT ROW YOU WANT

In [332]:
row_A = df.iloc[0] # Here it is 'A'
row_B = df.iloc[1] # Here it is 'B'
row_C = df.iloc[2] # Here it is 'C'
row_D = df.iloc[3] # Here it is 'D'
row_E = df.iloc[4] # Here it is 'E'

In [333]:
print(f'\n Row A: \n\n {row_A}')
print(f'\n Row B: \n\n {row_B}')
print(f'\n Row C: \n\n {row_C}')
print(f'\n Row D: \n\n {row_D}')
print(f'\n Row E: \n\n {row_E}')

 Row A:

 W           17
X           11
Y            4
Z            7
addition    39
Name: A, dtype: int32

 Row B:

 W           11
X            5
Y           17
Z           18
addition    51
Name: B, dtype: int32

 Row C:

 W           13
X            6
Y            3
Z           14
addition    36
Name: C, dtype: int32

 Row D:

 W           17
X           13
Y           15
Z           17
addition    62
Name: D, dtype: int32

 Row E:

 W            0
X           15
Y           18
Z           11
addition    44
Name: E, dtype: int32

## Grabbing information from the DATASET

In [334]:
df

    W   X   Y   Z  addition
A  17  11   4   7        39
B  11   5  17  18        51
C  13   6   3  14        36
D  17  13  15  17        62
E   0  15  18  11        44

In [335]:
# row - B, col - Y
df.loc['B','Y']

17

In [336]:
df.loc[['A','C'], ['W','Y']] # Multiple data from the dataset

    W  Y
A  17  4
C  13  3